package com.bcgtgjyb.mylibrary.base.bean;

import java.util.List;

/**
 * Created by bigwen on 2016/1/6.
 */
public class Joke {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allNum":15703,"allPages":786,"contentlist":[{"ct":"2016-01-02 18:00:15.710","text":"\u201c越精致的食物，越容易受到大众的喜欢。\u201d厨房里，老厨师在耐心的教导小学徒。小学徒似懂非懂地点点头问：\u201c那月经制的食物都有哪些？\u201d\u201c毛血旺\u201d尼玛，再也不吃毛血旺了","title":"越精致的食物","type":1},{"ct":"2016-01-02 18:00:15.710","text":"同事在家煮了二个鸡蛋带到办公室吃，他一边吃着鸡蛋，一边喝着茶叶水。我问他：\u201c你这是什么吃法，吃鸡蛋还配茶叶水。\u201d这二货得瑟到：\u201c俺这是在吃茶叶蛋。\u201d","title":"俺这是在吃茶叶蛋","type":1},{"ct":"2016-01-02 18:00:15.710","text":"饭店，中午一顾客来吃面，吆喝老板：\u201c一碗牛肉面，稀一点，不要汤\u201d老板说\u201c好地\u201d，然后就去厨房了。。。不一会，一厨师拎着把菜刀出来了：\u201c孙子，来来来，你教我怎么做\u201d。","title":"一碗牛肉面","type":1},{"ct":"2016-01-02 17:30:14.199","text":"有对夫妻吵架，吵到最后，谁也不服谁。就在陷入僵局的时候，老丈人说了一句话，他说：人家说女人是水做的，男人是土做的，看来一点也没有错！这时，妻子回答：您的意思是说女人是水男人是土，谁也离不开谁吗？老丈人摇了摇头说：我的意思是说你们水土不服啊！","title":"吵到最后，谁也不服谁","type":1},{"ct":"2016-01-02 17:30:14.199","text":"老婆问老公：你的朋友呢？老公指了指老婆胸前， 老婆瞬间就领会了，说道：嗯，劳动节去爬山也是很不错的选择。谁知，老公说道：我是说他们去飞机场了。","title":"你的朋友呢","type":1},{"ct":"2016-01-02 17:30:14.199","text":"一位朝鲜导游对游客说： \u201c我国经济腾飞。我们不但现在已经有了核武器，而且不久的将来公民都将拥有私人飞机。\u201d一位美国游客发问：\u201c对老百姓而言，私人飞机用处不大吧？\u201d导游回答他：\u201c不，私人有飞机用处大着呢。随便举个例子，假设你是农民，听说平壤的面包不限量供应，又大又甜又便宜，你就可以立马驾驶飞机赶到那里抢购。\u201d","title":"拥有私人飞机","type":1},{"ct":"2016-01-02 17:30:14.199","text":"昨天上公交，看见一个色狼猥亵一个美女。 美女大喊：流氓！我噌就过去了， 一把拽住流氓的领子：在光天化日之下你竟敢干这个！敢跟哥我耍耍吗？ 流氓鄙夷：别装了，我们顶多半斤八两。 我是流氓，那你是耍流氓！","title":"在光天化日之下","type":1},{"ct":"2016-01-02 17:30:14.198","text":"我：别以为当警察就厉害，我的车就爱停这里，怎么啦，老子有的是钱，随便你抄牌，我就不走怎么啦？警察面无表情的抄完，一贴罚单，走了。看他牛气的背影，我暗自喜道：终于又帮老板开了一张罚单，真是爽啊！","title":"老子有的是钱","type":1},{"ct":"2016-01-02 17:30:14.198","text":"同学会遇上一个之前关系比较好的哥们，这家伙混的挺好的，开了一个大公司。我问他：\u201c哥们，现在公司一年能盈利多少钱啊，是不是赚翻了？\u201d他叹气道：\u201c那是，前几天还被央视晚会邀请，非要我去讲讲创业历程，我是不去都不行！\u201d我当时就纳闷了，这央视多大个媒体啊，帮你宣传还不去，装什么B呢，忙问：\u201c是什么节目啊。\u201d他叹气道：\u201c315晚会。\u201d","title":"公司一年能盈利多少钱","type":1},{"ct":"2016-01-02 17:30:14.176","text":"我：我觉得这个时代大家都过得不容易，没必要谁为难谁？你说是不是？好了，过去的事就不提了，大家以后还开开心心的是朋友。强哥：开心你妹，赶快把欠我的钱还啦，你借钱不还，还TM成我的错了！","title":"大家都过得不容易","type":1},{"ct":"2016-01-02 17:30:14.176","text":"一天，住在屁股的蛆虫带着礼物（屎）去见他的远房亲戚--住在嘴巴里的牙虫。病人：医生，你确定这就是我口臭的原因？医生：我十分肯定。","title":"住在嘴巴里的牙虫","type":1},{"ct":"2016-01-02 17:30:14.176","text":"老板对职工说：根据国家提倡不要浪费原则。 以后中午饭不要大吃大喝，但是我们保证四菜一汤。<\/p><p>中午吃饭了。 在食堂。 我就看见一个汤，却没有看见菜，我问打饭师傅：不是四菜一汤吗？菜呢？<\/p><p>师傅回答说：这就是四菜一汤啊！你看！这不是土豆丝儿、白菜、木耳、干豆腐四菜，放一起炖的汤吗？","title":"不要浪费原则","type":1},{"ct":"2016-01-02 17:00:12.891","text":"为什么不更新了","title":"为什么不更新了","type":1},{"ct":"2016-01-02 16:30:14.892","text":"1.学校晚上要提供营养餐，一盒牛奶，一个鸡蛋。这周第一次发，我们班一个女生就问生活委员这个奶要不要钱，要钱的话就不要了，我们自己有带奶。然后她前面的男生道：那照你这么说，我们男生也可以不要蛋了？<\/p><p>然后全班爆笑。。。<\/p><p>2.晚上，我哭着回宿舍，室友小妹听说我被男朋友欺负了！气得她马上换好衣服，连夜跳寝室找我男朋友为我讨要说法。。。一宿都TM没回来，真是好姐妹。。。<\/p><p>3.一养鸟人教鹦鹉说话，每早必教它说：早上好！过数月，鹦鹉仍不说话，一日，此人心情不佳，未问好，只听鹦鹉大叫：你小子今天牛了啊，连好也不问！<\/p><p>4.发英语试卷，小明就对一个选择题，得了3分。英语老师在讲台上咆哮：\u201c你告诉我3分能干什么？\u201d小明弱弱地回答：\u201c抢地主。。。\u201d<\/p><p>5.早上去跑步，遇到一个大胸美女也在跑步，于是调侃的说：\u201c美女，跑起来一颤一颤的舒服吗？\u201d美女白了我一眼说：\u201c你跑起来一甩一甩的疼吗？\u201d<\/p><p>卧槽，我竟无言以对～<\/p><p>6.经理做了个痔疮手术，同事们约着一起去医院探望。男男女女七八个人来到病房，都对着经理呵呵地傻笑，谁也不好意思开口问他的病情。只听司机老张干咳了两声，很认真地问经理：\u201c听说\u2018底盘\u2019出了点故障，现在好些了吗？\u201d<\/p><p>7.闺密打电话说晚上请吃饭，我问是不是有啥心事啊，又跟家里阿姨吵架拉，她说别提了，前一阵子中午午休，梦见四五个壮汉要轮奸她，正要开始呢，就被她妈吵醒了，这不都吵架好几天了\u2026\u2026\u2026\u2026","title":"一日一囧1116：糗事一箩筐！","type":1},{"ct":"2016-01-02 13:00:14.387","text":"今天儿子老师请家长，我到老师办公室蒙了，这不是当年我的班主任吗？他看到我也是一愣说：这是你儿子？我点点头。老师叹了口气说：真是青出于蓝胜于蓝，当年你是在我椅子上，放图钉扎我！你儿子现在是在我走路时，双手合起来爆我菊花！！","title":"双手合起来爆我菊花","type":1},{"ct":"2016-01-02 13:00:14.387","text":"甲旷课后问室友：\u201c老师今天点名没？\u201d室友回答：\u201c没点！\u201d甲庆幸地说：\u201c这老师每次都点名，今天居然没点，我太幸运啦！\u201d室友无奈地回道：\u201c今天上课，就我一个人去了。\u201d","title":"老师今天点名没？","type":1},{"ct":"2016-01-02 13:00:14.344","text":"考试以后有孩子为自己取了一个名字\u2014\u2014哲布慧·娜耶布惠·泉布慧，家长也给自己起了一个名字：成吉不提·明刺耶不提·申马窦别提","title":"为自己取了一个名字","type":1},{"ct":"2016-01-02 13:00:14.342","text":"世界最虐心的三角恋是什么？我喜欢假期，假期喜欢作业，作业喜欢我。","title":"最虐心的三角恋","type":1},{"ct":"2016-01-02 13:00:14.342","text":"在学校食堂买饭的时候，如果你前面排有几个人，那可能不是几个人，而是几个宿舍。","title":"前面排有几个人","type":1},{"ct":"2016-01-02 13:00:14.336","text":"老师，这道数学题已经超出了我语文的理解范围！","title":"语文的理解范围！","type":1}],"currentPage":14,"maxResult":20,"ret_code":0}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    /**
     * allNum : 15703
     * allPages : 786
     * contentlist : [{"ct":"2016-01-02 18:00:15.710","text":"\u201c越精致的食物，越容易受到大众的喜欢。\u201d厨房里，老厨师在耐心的教导小学徒。小学徒似懂非懂地点点头问：\u201c那月经制的食物都有哪些？\u201d\u201c毛血旺\u201d尼玛，再也不吃毛血旺了","title":"越精致的食物","type":1},{"ct":"2016-01-02 18:00:15.710","text":"同事在家煮了二个鸡蛋带到办公室吃，他一边吃着鸡蛋，一边喝着茶叶水。我问他：\u201c你这是什么吃法，吃鸡蛋还配茶叶水。\u201d这二货得瑟到：\u201c俺这是在吃茶叶蛋。\u201d","title":"俺这是在吃茶叶蛋","type":1},{"ct":"2016-01-02 18:00:15.710","text":"饭店，中午一顾客来吃面，吆喝老板：\u201c一碗牛肉面，稀一点，不要汤\u201d老板说\u201c好地\u201d，然后就去厨房了。。。不一会，一厨师拎着把菜刀出来了：\u201c孙子，来来来，你教我怎么做\u201d。","title":"一碗牛肉面","type":1},{"ct":"2016-01-02 17:30:14.199","text":"有对夫妻吵架，吵到最后，谁也不服谁。就在陷入僵局的时候，老丈人说了一句话，他说：人家说女人是水做的，男人是土做的，看来一点也没有错！这时，妻子回答：您的意思是说女人是水男人是土，谁也离不开谁吗？老丈人摇了摇头说：我的意思是说你们水土不服啊！","title":"吵到最后，谁也不服谁","type":1},{"ct":"2016-01-02 17:30:14.199","text":"老婆问老公：你的朋友呢？老公指了指老婆胸前， 老婆瞬间就领会了，说道：嗯，劳动节去爬山也是很不错的选择。谁知，老公说道：我是说他们去飞机场了。","title":"你的朋友呢","type":1},{"ct":"2016-01-02 17:30:14.199","text":"一位朝鲜导游对游客说： \u201c我国经济腾飞。我们不但现在已经有了核武器，而且不久的将来公民都将拥有私人飞机。\u201d一位美国游客发问：\u201c对老百姓而言，私人飞机用处不大吧？\u201d导游回答他：\u201c不，私人有飞机用处大着呢。随便举个例子，假设你是农民，听说平壤的面包不限量供应，又大又甜又便宜，你就可以立马驾驶飞机赶到那里抢购。\u201d","title":"拥有私人飞机","type":1},{"ct":"2016-01-02 17:30:14.199","text":"昨天上公交，看见一个色狼猥亵一个美女。 美女大喊：流氓！我噌就过去了， 一把拽住流氓的领子：在光天化日之下你竟敢干这个！敢跟哥我耍耍吗？ 流氓鄙夷：别装了，我们顶多半斤八两。 我是流氓，那你是耍流氓！","title":"在光天化日之下","type":1},{"ct":"2016-01-02 17:30:14.198","text":"我：别以为当警察就厉害，我的车就爱停这里，怎么啦，老子有的是钱，随便你抄牌，我就不走怎么啦？警察面无表情的抄完，一贴罚单，走了。看他牛气的背影，我暗自喜道：终于又帮老板开了一张罚单，真是爽啊！","title":"老子有的是钱","type":1},{"ct":"2016-01-02 17:30:14.198","text":"同学会遇上一个之前关系比较好的哥们，这家伙混的挺好的，开了一个大公司。我问他：\u201c哥们，现在公司一年能盈利多少钱啊，是不是赚翻了？\u201d他叹气道：\u201c那是，前几天还被央视晚会邀请，非要我去讲讲创业历程，我是不去都不行！\u201d我当时就纳闷了，这央视多大个媒体啊，帮你宣传还不去，装什么B呢，忙问：\u201c是什么节目啊。\u201d他叹气道：\u201c315晚会。\u201d","title":"公司一年能盈利多少钱","type":1},{"ct":"2016-01-02 17:30:14.176","text":"我：我觉得这个时代大家都过得不容易，没必要谁为难谁？你说是不是？好了，过去的事就不提了，大家以后还开开心心的是朋友。强哥：开心你妹，赶快把欠我的钱还啦，你借钱不还，还TM成我的错了！","title":"大家都过得不容易","type":1},{"ct":"2016-01-02 17:30:14.176","text":"一天，住在屁股的蛆虫带着礼物（屎）去见他的远房亲戚--住在嘴巴里的牙虫。病人：医生，你确定这就是我口臭的原因？医生：我十分肯定。","title":"住在嘴巴里的牙虫","type":1},{"ct":"2016-01-02 17:30:14.176","text":"老板对职工说：根据国家提倡不要浪费原则。 以后中午饭不要大吃大喝，但是我们保证四菜一汤。<\/p><p>中午吃饭了。 在食堂。 我就看见一个汤，却没有看见菜，我问打饭师傅：不是四菜一汤吗？菜呢？<\/p><p>师傅回答说：这就是四菜一汤啊！你看！这不是土豆丝儿、白菜、木耳、干豆腐四菜，放一起炖的汤吗？","title":"不要浪费原则","type":1},{"ct":"2016-01-02 17:00:12.891","text":"为什么不更新了","title":"为什么不更新了","type":1},{"ct":"2016-01-02 16:30:14.892","text":"1.学校晚上要提供营养餐，一盒牛奶，一个鸡蛋。这周第一次发，我们班一个女生就问生活委员这个奶要不要钱，要钱的话就不要了，我们自己有带奶。然后她前面的男生道：那照你这么说，我们男生也可以不要蛋了？<\/p><p>然后全班爆笑。。。<\/p><p>2.晚上，我哭着回宿舍，室友小妹听说我被男朋友欺负了！气得她马上换好衣服，连夜跳寝室找我男朋友为我讨要说法。。。一宿都TM没回来，真是好姐妹。。。<\/p><p>3.一养鸟人教鹦鹉说话，每早必教它说：早上好！过数月，鹦鹉仍不说话，一日，此人心情不佳，未问好，只听鹦鹉大叫：你小子今天牛了啊，连好也不问！<\/p><p>4.发英语试卷，小明就对一个选择题，得了3分。英语老师在讲台上咆哮：\u201c你告诉我3分能干什么？\u201d小明弱弱地回答：\u201c抢地主。。。\u201d<\/p><p>5.早上去跑步，遇到一个大胸美女也在跑步，于是调侃的说：\u201c美女，跑起来一颤一颤的舒服吗？\u201d美女白了我一眼说：\u201c你跑起来一甩一甩的疼吗？\u201d<\/p><p>卧槽，我竟无言以对～<\/p><p>6.经理做了个痔疮手术，同事们约着一起去医院探望。男男女女七八个人来到病房，都对着经理呵呵地傻笑，谁也不好意思开口问他的病情。只听司机老张干咳了两声，很认真地问经理：\u201c听说\u2018底盘\u2019出了点故障，现在好些了吗？\u201d<\/p><p>7.闺密打电话说晚上请吃饭，我问是不是有啥心事啊，又跟家里阿姨吵架拉，她说别提了，前一阵子中午午休，梦见四五个壮汉要轮奸她，正要开始呢，就被她妈吵醒了，这不都吵架好几天了\u2026\u2026\u2026\u2026","title":"一日一囧1116：糗事一箩筐！","type":1},{"ct":"2016-01-02 13:00:14.387","text":"今天儿子老师请家长，我到老师办公室蒙了，这不是当年我的班主任吗？他看到我也是一愣说：这是你儿子？我点点头。老师叹了口气说：真是青出于蓝胜于蓝，当年你是在我椅子上，放图钉扎我！你儿子现在是在我走路时，双手合起来爆我菊花！！","title":"双手合起来爆我菊花","type":1},{"ct":"2016-01-02 13:00:14.387","text":"甲旷课后问室友：\u201c老师今天点名没？\u201d室友回答：\u201c没点！\u201d甲庆幸地说：\u201c这老师每次都点名，今天居然没点，我太幸运啦！\u201d室友无奈地回道：\u201c今天上课，就我一个人去了。\u201d","title":"老师今天点名没？","type":1},{"ct":"2016-01-02 13:00:14.344","text":"考试以后有孩子为自己取了一个名字\u2014\u2014哲布慧·娜耶布惠·泉布慧，家长也给自己起了一个名字：成吉不提·明刺耶不提·申马窦别提","title":"为自己取了一个名字","type":1},{"ct":"2016-01-02 13:00:14.342","text":"世界最虐心的三角恋是什么？我喜欢假期，假期喜欢作业，作业喜欢我。","title":"最虐心的三角恋","type":1},{"ct":"2016-01-02 13:00:14.342","text":"在学校食堂买饭的时候，如果你前面排有几个人，那可能不是几个人，而是几个宿舍。","title":"前面排有几个人","type":1},{"ct":"2016-01-02 13:00:14.336","text":"老师，这道数学题已经超出了我语文的理解范围！","title":"语文的理解范围！","type":1}]
     * currentPage : 14
     * maxResult : 20
     * ret_code : 0
     */

    private ShowapiResBodyEntity showapi_res_body;

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public void setShowapi_res_body(ShowapiResBodyEntity showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public ShowapiResBodyEntity getShowapi_res_body() {
        return showapi_res_body;
    }

    public static class ShowapiResBodyEntity {
        private int allNum;
        private int allPages;
        private int currentPage;
        private int maxResult;
        private int ret_code;
        /**
         * ct : 2016-01-02 18:00:15.710
         * text : “越精致的食物，越容易受到大众的喜欢。”厨房里，老厨师在耐心的教导小学徒。小学徒似懂非懂地点点头问：“那月经制的食物都有哪些？”“毛血旺”尼玛，再也不吃毛血旺了
         * title : 越精致的食物
         * type : 1
         */

        private List<ContentlistEntity> contentlist;

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public void setContentlist(List<ContentlistEntity> contentlist) {
            this.contentlist = contentlist;
        }

        public int getAllNum() {
            return allNum;
        }

        public int getAllPages() {
            return allPages;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public int getRet_code() {
            return ret_code;
        }

        public List<ContentlistEntity> getContentlist() {
            return contentlist;
        }

        public static class ContentlistEntity {
            private String ct;
            private String text;
            private String title;
            private int type;

            public void setCt(String ct) {
                this.ct = ct;
            }

            public void setText(String text) {
                this.text = text;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public String getText() {
                return text;
            }

            public String getTitle() {
                return title;
            }

            public int getType() {
                return type;
            }
        }
    }
}
